Revit 2026 API

# GroupLoadOptionsIncludeAttachedDetails Property

---

True if attached detail groups should be included, false otherwise. The default value is .

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IncludeAttachedDetails { get; set; }
```
```vb
Public Property IncludeAttachedDetails As Boolean
	Get
	Set
```
```cpp
public:
property bool IncludeAttachedDetails {
	bool get ();
	void set (bool value);
}
```
```fsharp
member IncludeAttachedDetails : bool with get, set
```

#### Property Value

Boolean

#### Reference

GroupLoadOptions Class

Autodesk.Revit.DB Namespace